/**
 * Created by dianying on 2017/12/22.
 */
var a = {
  "params": [
    {
      "name": "屏幕尺寸",
      "value": "9.7英寸屏幕"
    },
    {
      "name": "屏幕尺寸12",
      "value": "9.7英寸屏幕"
    },
    {
      "name": "屏幕尺寸",
      "value": "9.7英寸屏幕"
    },
    {
      "name": "硬盘容量",
      "value": "256GB"
    },
    {
      "name": "核心数量",
      "value": "四核处理器"
    },
    {
      "name": "内存容量",
      "value": "4GB内存"
    },
    {
      "name": "上市时间",
      "value": "2017/04"
    },
    {
      "name": "处理器型号",
      "value": "高通骁龙820"
    },
    {
      "name": "分辨率",
      "value": "2048×1536"
    },
    {
      "name": "摄像头类型",
      "value": "双摄像头"
    },
    {
      "name": "电池容量",
      "value": "6000MAH"
    },
    {
      "name": "接口类型",
      "value": "音频接口,USB,OTG"
    },
    {
      "name": "操作系统",
      "value": "安卓"
    },
    {
      "name": "品牌",
      "value": "Samsung/三星"
    },
    {
      "name": "型号",
      "value": "SM-T825C"
    },
    {
      "name": "4G网络",
      "value": "支持"
    },
    {
      "name": "CPU主频",
      "value": "1.6GHz,2.15GHz"
    },
    {
      "name": "产品类型",
      "value": "商务平板"
    },
    {
      "name": "尺寸",
      "value": "237.3*169*6mm"
    },
    {
      "name": "电池类型",
      "value": "聚合物锂电池"
    },
    {
      "name": "重量",
      "value": "434G"
    },
    {
      "name": "续航时间",
      "value": "具体时间视使用环境而定"
    },
    {
      "name": "存储类型",
      "value": "闪存"
    },
    {
      "name": "触摸屏类型",
      "value": "电容屏"
    },
    {
      "name": "附加功能",
      "value": "电话,陀螺仪,光线感应,指纹识别器,蓝牙,重力感应,3G通话,原笔迹手写,GPS"
    },
    {
      "name": "是否支持蓝牙",
      "value": "支持"
    },
    {
      "name": "前置摄像头像素",
      "value": "500万像素"
    },
    {
      "name": "后置摄像头像素",
      "value": "1300万像素"
    }
  ]
};
var b = {
  date: '2016-05-04',
  name: '王小虎',
  province: '上海',
  city: '普陀区',
  address: '上海市普陀区金沙江路 1518 弄',
  zip: 200333
};
let show = {
  '屏幕尺寸': {h4: '9.7英寸屏幕'},
  '屏幕尺寸12': {h4: '9.7英寸屏幕'},
  '硬盘容量': {h4: '256GB'},
  '核心数量': {h4: '四核处理器'},
  '内存容量': {h4: '4GB内存'},
  '上市时间': {h4: '2017/04'},
  '处理器型号': {h4: '高通骁龙820'},
  '分辨率': {h4: '2048×1536'},
  '摄像头类型': {h4: '双摄像头'},
  '电池容量': {h4: '6000MAH'},
  '接口类型': {h4: '音频接口,USB,OTG'},
  '操作系统': {h4: '安卓'},
  '品牌': {h4: 'Samsung/三星'},
  '型号': {h4: 'SM-T825C'},
  '4G网络': {h4: '支持'},
  'CPU主频': {h4: '1.6GHz,2.15GHz'},
  '产品类型': {h4: '商务平板'},
  '尺寸': {h4: '237.3*169*6mm'},
  '电池类型': {h4: '聚合物锂电池'},
  '重量': {h4: '434G'},
  '续航时间': {h4: '具体时间视使用环境而定'},
  '存储类型': {h4: '闪存'},
  '触摸屏类型': {h4: '电容屏'},
  '附加功能': {h4: '电话,陀螺仪,光线感应,指纹识别器,蓝牙,重力感应,3G通话,原笔迹手写,GPS'},
  '是否支持蓝牙': {h4: '支持'},
  '前置摄像头像素': {h4: '500万像素'},
  '后置摄像头像素': {h4: '1300万像素'}
};

a = a.params;
 for (let key in a) {
 if (!show[a[key]["name"]]) {
 let l = show.length;
 show[a[key]["name"]] = {};
 for (let i = 0; i < l; i++) {
 show[a[key]["name"]]["h5"] = "-"
 }
 }
 show[a[key]["name"]]["h5"] = (a[key]["value"])
 }
 let ary = [{title: ""}];
 let i = 0;
 for (let key in show) {
 i++;
 ary[i] = {};
 ary[i]["title"] = key;
 for (let l in show[key]) {
 ary[i][l] = show[key][l];
 }
 }
console.log(ary);


